Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AT</name>
         <version>049321a0</version>
         <description>Anti-Tamper Controller (AT)</description>
         <baseAddress>0x4500C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x238</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AT</name>
            <value>138</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control Register A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset1 = Reset registers , Bus I/F and internal state0 = No effect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>AT registers accessible in privileged and unprivileged modes.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AT registers only accessible in privileged mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>RUNSTDBY Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>TAMPER_KEY[%s]</name>
               <description>Tamper Key n Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMPERKEY</name>
                     <description>Tamper Key Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__LEVELA</name>
               <description>Tamper levels 0 to 7.</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEVEL0</name>
                     <description>Level 0.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL1</name>
                     <description>Level 1.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL2</name>
                     <description>Level 2.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL3</name>
                     <description>Level 3.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL4</name>
                     <description>Level 4.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL5</name>
                     <description>Level 5.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL6</name>
                     <description>Level 6.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL7</name>
                     <description>Level 7.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__LEVELB</name>
               <description>Tamper levels 8 to 15.</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEVEL8</name>
                     <description>Level 8.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL9</name>
                     <description>Level 9.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL10</name>
                     <description>Level 10.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL11</name>
                     <description>Level 11.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL12</name>
                     <description>Level 12.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL13</name>
                     <description>Level 13.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL14</name>
                     <description>Level 14.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL15</name>
                     <description>Level 15.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__LEVELC</name>
               <description>Tamper levels 16 to 23.</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEVEL16</name>
                     <description>Level 16.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL17</name>
                     <description>Level 17.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL18</name>
                     <description>Level 18.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL19</name>
                     <description>Level 19.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL20</name>
                     <description>Level 20.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL21</name>
                     <description>Level 21.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL22</name>
                     <description>Level 22.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL23</name>
                     <description>Level 23.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__LEVELD</name>
               <description>Tamper levels 24 to 31.</description>
               <addressOffset>0x20C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEVEL24</name>
                     <description>Level 24.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL25</name>
                     <description>Level 25.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL26</name>
                     <description>Level 26.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL27</name>
                     <description>Level 27.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL28</name>
                     <description>Level 28.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL29</name>
                     <description>Level 29.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL30</name>
                     <description>Level 30.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LEVEL31</name>
                     <description>Level 31.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__SETLEVEL</name>
               <description>Set tamper level.</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LEVEL</name>
                     <description>Tamper level.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ID</name>
                     <description>Tamper ID.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTKEY</name>
                     <description>Protection key (0xA84C).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__FILTERCFG</name>
               <description>Filter configuration (threshold, period).</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THRESH</name>
                     <description>Threshold.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>Period.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTKEY</name>
                     <description>Protection key (0x92F5).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__SOFTTAMP</name>
               <description>Software triggered tamper.</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Tamper active.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ID</name>
                     <description>Tamper ID.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PROTKEY</name>
                     <description>Protection key (0x4BEE).</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__RAWSTAT</name>
               <description>Raw status.</description>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAWSTAT</name>
                     <description>Raw status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__STAT</name>
               <description>Status (write to clear).</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STAT</name>
                     <description>Status (write to clear).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__TIMESTAMP</name>
               <description>Timestamp for the last tamper.</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMESTAMP</name>
                     <description>Timestamp for the last tamper.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__FILTERCNT</name>
               <description>Current value of filter counter.</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FILTERCNT</name>
                     <description>Current value of filter counter.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__SOFTINFO</name>
               <description>Register for software purpose only.</description>
               <addressOffset>0x22C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOFTINFO</name>
                     <description>Register for software purpose only.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__TAMPERFLAG</name>
               <description>The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output.</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAMPERFLAG</name>
                     <description>The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>anti_tamper__SOFTRESET</name>
               <description>Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above.</description>
               <addressOffset>0x234</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOFTRESET</name>
                     <description>Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
