Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="CAN0">
         <name>CAN1</name>
         <baseAddress>0x44030000</baseAddress>
         <interrupt>
            <name>CAN1_INT0</name>
            <value>38</value>
         </interrupt>
         <interrupt>
            <name>CAN1_INT1</name>
            <value>39</value>
         </interrupt>
         <interrupt>
            <name>CAN1_BERR</name>
            <value>40</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>CCL0</name>
         <version>036282b0</version>
         <description>Configurable Custom Logic</description>
         <groupName>CCL</groupName>
         <prependToName>CCL_</prependToName>
         <baseAddress>0x4482E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The peripheral is not reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The peripheral is reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The peripheral is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The peripheral is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RUNSTDBYSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Generic clock is not required in standby sleep mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Generic clock is  required in standby sleep mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>SEQCTRL[%s]</name>
               <description>SEQ Control x</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SEQSEL</name>
                     <description>Sequential Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SEQSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Sequential logic is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFF</name>
                           <description>D flip flop</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JK</name>
                           <description>JK flip flop</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LATCH</name>
                           <description>D latch</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RS</name>
                           <description>RS latch</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>LUTCTRL[%s]</name>
               <description>LUT Control x</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>LUT Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT block is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT block is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTSEL</name>
                     <description>Filter Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Filter disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNCH</name>
                           <description>Synchronizer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGESEL</name>
                     <description>Edge Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EDGESELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Edge detector is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Edge detector is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL0</name>
                     <description>Input Selection 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL0Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL0</name>
                           <description>Peripheral 0 input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL1</name>
                           <description>Peripheral 1 input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL2</name>
                           <description>Peripheral 2 input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL3</name>
                           <description>Peripheral 3 input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL4</name>
                           <description>Peripheral 4 input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL5</name>
                           <description>Peripheral 5 input source</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source. The EVENT input will bypass edge detection logic.</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL1</name>
                     <description>Input Selection 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL1Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL0</name>
                           <description>Peripheral 0 input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL1</name>
                           <description>Peripheral 1 input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL2</name>
                           <description>Peripheral 2 input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL3</name>
                           <description>Peripheral 3 input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL4</name>
                           <description>Peripheral 4 input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL5</name>
                           <description>Peripheral 5 input source</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source. The EVENT input will bypass edge detection logic.</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL2</name>
                     <description>Input Selection 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL2Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL0</name>
                           <description>Peripheral 0 input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL1</name>
                           <description>Peripheral 1 input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL2</name>
                           <description>Peripheral 2 input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL3</name>
                           <description>Peripheral 3 input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL4</name>
                           <description>Peripheral 4 input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERSEL5</name>
                           <description>Peripheral 5 input source</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source. The EVENT input will bypass edge detection logic.</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVEI</name>
                     <description>Inverted Event Input Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INVEISelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Incoming event is not inverted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Incoming event is inverted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEI</name>
                     <description>LUT Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEISelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT incoming event is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT incoming event is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEO</name>
                     <description>LUT Event Output Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEOSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT event output is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT event output is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRUTH</name>
                     <description>Truth Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
