Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
            <register>
               <name>CRCMADR</name>
               <description>CRC Message Address REGISTER</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCMADR</name>
                     <description>Message Start Address in Flash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCMLEN</name>
               <description>CRC Message Length REGISTER</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCMLEN</name>
                     <description>Message Length in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCIV</name>
               <description>CRC Initial Value REGISTER</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCIV</name>
                     <description>CRC Initial Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCACC</name>
               <description>CRC Accumulator REGISTER</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCACC</name>
                     <description>CRC Accumulator Result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCPOLY</name>
               <description>CRC Polynomial REGISTER</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC Polynomial Coefficients for LFSR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>CRCPOLYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable the XOR input to the shift register at the associated bit position</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable the XOR input to the shift register at the associated bit position</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCFXOR</name>
               <description>CRC Final XOR REGISTER</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCFXOR</name>
                     <description>CRC Final XOR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>CRCFXORSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable the Final XOR at the associated bit position</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable the Final XOR at the associated bit position</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCSUM</name>
               <description>CRC CheckSUM REGISTER</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCSUM</name>
                     <description>CRC Checksum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTCTRL</name>
               <description>Flash ECC Fault Control REGISTER</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTRST</name>
                     <description>Fault Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTRSTSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>Resets all FLT SFR bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTEN</name>
                     <description>ECC Fault Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>ECC Fault Injection Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>ECC Fault Injection Enabled (module performs operation selected by FFLTMODE.FLTMD)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTMODE</name>
               <description>Flash ECC Fault Mode REGISTER</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTLFLT</name>
                     <description>ECC/Parity Control Fault bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CTLFLTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Fault Injected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Inject a Fault on to the associated ECC/Parity Control bits (CTL[n])</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTMD</name>
                     <description>Fault Mode Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FLTMDSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Fault Injection Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPT</name>
                           <description>Fault Capture Mode Enabled - Captures the address (in FLTADR) and Syndrome in (FLTSYN)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLEREAD</name>
                           <description>Single Fault Injection (at bit selected by FLT1PTR) for Reads</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLEREAD</name>
                           <description>Double Fault Injection for Reads</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLEWRITE</name>
                           <description>Single Fault Injection (at bit selected by FLT1PTR) for Writes</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLEWRITE</name>
                           <description>Double Fault Injection for Writes</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTPTR</name>
               <description>Flash ECC Fault Pointer REGISTER</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTPTR1</name>
                     <description>Fault 1 Injection Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FLTPTR2</name>
                     <description>Fault 2 Injection Pointer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTADR</name>
               <description>Flash ECC Fault Address REGISTER</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Fault Injection Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTCAP</name>
               <description>Flash ECC Fault Capture Address REGISTER</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTADR</name>
                     <description>Fault Capture Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTPAR</name>
               <description>Flash ECC Fault Parity REGISTER</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECIN</name>
                     <description>The Single Error Parity bits from Flash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DEDIN</name>
                     <description>The Overall Parity from Flash</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECOUT</name>
                     <description>The Calculated Single Error Parity bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DEDOUT</name>
                     <description>The Calculated Overall Parity used in Double Error Detection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFLTSYN</name>
               <description>Flash ECC Fault Syndrome REGISTER</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECSYN</name>
                     <description>Single Error Correction Syndrome</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DEDSYN</name>
                     <description>DED Syndrome</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DEDSYNSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Calculated Overall Parity Concurs with Read Overall Parity</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Calculated Overall Parity Differs from Read Overall Parity</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DSERR</name>
                     <description>Double Error Detected &amp; Single Error Corrected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DSERRSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Errors</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Error Corrected</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_10</name>
                           <description>Double Error Detected</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_11</name>
                           <description>Double Error Detected</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CERR</name>
                     <description>ECC Control bit Error</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CERRSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Control bit Error (ECCSTAT either 111 or 000)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Control Bit Error</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTLSTAT</name>
                     <description>Parity vs ECC Control Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CTLSTATSelect</name>
                        <enumeratedValue>
                           <name>USEDECC_0</name>
                           <description>Calculation used ECC (i.e. programming used quad write)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDECC_1</name>
                           <description>Calculation used ECC (i.e. programming used quad write)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDECC_10</name>
                           <description>Calculation used ECC (i.e. programming used quad write)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDPARITY_11</name>
                           <description>Calculation used Parity (i.e. programming used single write)</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDECC_100</name>
                           <description>Calculation used ECC (i.e. programming used quad write)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDPARITY_101</name>
                           <description>Calculation used Parity (i.e. programming used single write)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDPARITY_110</name>
                           <description>Calculation used Parity (i.e. programming used single write)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEDPARITY_111</name>
                           <description>Calculation used Parity (i.e. programming used single write)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERR</name>
                     <description>Per Word (n=3:0) Parity Error Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PERRSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Parity Error on Word n</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERROR</name>
                           <description>Parity Error on Word n</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
