Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FCW</name>
         <version>049712a0</version>
         <description>Polaris Flash Write Controller</description>
         <baseAddress>0x44004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FCW</name>
            <value>1</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Macro register accessible in privileged and unprivileged accesses.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Macro registers only accessible in privileged accesses</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLOP</name>
               <description>Control Operation REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NVMOP</name>
                     <description>NVM Operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>NVMOPSelect</name>
                        <enumeratedValue>
                           <name>NOP</name>
                           <description>No Operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLEWRITE</name>
                           <description>Single (Word) Program Operation: Programs word selected by ADDR</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QUADWRITE</name>
                           <description>Quad (Word) Program Operation: Programs flash word selected by ADDR</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROWWRITE</name>
                           <description>Row Write Operation: Programs row selected by ADDR</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PAGEERASE</name>
                           <description>Page Erase Operation: Erases page selected by ADDR</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPFMERASE</name>
                           <description>Lower PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPFMERASE</name>
                           <description>Upper PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PFMERASE</name>
                           <description>PFM Erase Operation: Upper &amp;amp; Lower PFM Erase</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CE</name>
                           <description>Chip Erase Operation: Erases PFM+SRF, BFM, CFM (except for CalOTP, Test, VSS pages if HSM is Present, UserOTP, &amp;amp; ROMCFG).</description>
                           <value>14</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREPG</name>
                     <description>NVM Pre-Program Configuration Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PREPGSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Program Operations exclude Pre-Program step</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Program Operations include Pre-Program step</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUTEX</name>
               <description>MUTEX REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Flash Write Controller (FCW) Lock by Owner</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCK</name>
                           <description>FCW is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCK</name>
                           <description>FCW is locked by owner</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OWNER</name>
                     <description>Flash Write Controller (FCW) Owner ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OWNERSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Owner - always 0 if LOCK=0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM</name>
                           <description>The System owns the FCW</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear REGISTER</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>KEYERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CFGERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FIFOERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUSERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WPERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OPERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HTDPGMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTERR</name>
                     <description>Reset or Brown Out Detect Error Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RSTERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WRERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
