Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
            <register>
               <name>INTFLAGSET</name>
               <description>Interrupt Flag Set REGISTER</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Set Flag Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Set Flag Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>KEYERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Set Flag Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CFGERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Set Flag Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FIFOERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Set Flag Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUSERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Set Flag Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WPERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Set Flag Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OPERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Set Flag Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HTDPGMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTERR</name>
                     <description>Reset or Brown Out Detect Error Set Flag Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RSTERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Set Flag Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WRERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status REGISTER</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>NVM Busy Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUSYSelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>NVM Not Busy</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUSY</name>
                           <description>NVM Busy - All SFR bits are not writable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HTDRDY</name>
                     <description>High Temp Detect Ready Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HTDRDYSelect</name>
                        <enumeratedValue>
                           <name>NOTREADY</name>
                           <description>HTD Not Ready</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>HTD Ready</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <description>Feature Unlock Key REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FEATURE</name>
                     <description>Feature Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FEATURESelect</name>
                        <enumeratedValue>
                           <name>LOCKALL</name>
                           <description>No selection, invalid selection, or invalid Key - Locks all SFR protected by KEY register</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRKEY</name>
                           <description>WRKEY Value: Unlock SFR bits associated with Write/Erase</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAPKEY</name>
                           <description>SWAPKEY Value: Unlock SFR bits associated with Panel Swapping</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CFGKEY</name>
                           <description>CFGKEY Value: Unlock SFR bits associated with general Flash configuration</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CODE</name>
                     <description>Unlock Code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Flash Destination Address REGISTER</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Flash Address used by NVMOP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR</name>
               <description>System Source Address REGISTER</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRCADDR</name>
                     <description>Source Data (Word) Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>DATA[%s]</name>
               <description>Flash Write Data n REGISTER</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Flash Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWAP</name>
               <description>NVM Panel Swap REGISTER</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFSWAP</name>
                     <description>BFM Swap Status/Control Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BFSWAPSelect</name>
                        <enumeratedValue>
                           <name>UNSWAP</name>
                           <description>Upper and Lower BFM Regions are NOT Swapped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP</name>
                           <description>Upper and Lower BFM Regions are Swapped</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BFSLOCK</name>
                     <description>BFM Swap Lock Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BFSLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>BFSLOCK and BFSWAP can be written</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>BFSLOCK and BFSWAP cannot be written</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSWAP</name>
                     <description>PFM Swap Status/Control Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PFSWAPSelect</name>
                        <enumeratedValue>
                           <name>UNSWAP</name>
                           <description>Upper and Lower PFM Regions are NOT Swapped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWAP</name>
                           <description>Upper and Lower PFM Regions are Swapped</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSLOCK</name>
                     <description>PFM Swap Lock Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PFSLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>PFSLOCK and PFSWAP can be written</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>PFSLOCK and PFSWAP cannot be written</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>PWP[%s]</name>
               <description>PFM Write Protect Region n REGISTER</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWPSIZE</name>
                     <description>PWP Size in 4KB pages</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PWPMIR</name>
                     <description>Mirror PWP bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PWPMIRSelect</name>
                        <enumeratedValue>
                           <name>UNMIRROR</name>
                           <description>PWP settings are NOT Mirrored</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MIRROR</name>
                           <description>PWP settings are Mirrored</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWPLOCK</name>
                     <description>PWP Lock Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PWPLOCKSelect</name>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>This register is Not Locked and can be modified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>This register is Locked and cannot be modified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWPEN</name>
                     <description>PWP Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PWPENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>PWP is Not Enabled for the defined region</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>PWP is Enabled for the defined region</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWPBASE</name>
                     <description>PWP Base Address - 4KB Page Aligned</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
