Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SERCOM0</name>
         <version>037156c0</version>
         <description>Serial Communication Interface</description>
         <groupName>SERCOM</groupName>
         <prependToName>SERCOM_</prependToName>
         <baseAddress>0x44808000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SERCOM0_6</name>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_5</name>
            <value>61</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_0</name>
            <value>62</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_1</name>
            <value>63</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_2</name>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_3</name>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>SERCOM0_4</name>
            <value>66</value>
         </interrupt>
         <registers>
            <cluster>
               <name>I2CM</name>
               <description>I2C Master Mode</description>
               <headerStructName>SercomI2cm</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C host mode operation</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FILTSEL</name>
                        <description>Input Filter Selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>FILTSELSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>Disable</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>50NS</name>
                              <description>Minimum 50ns filter</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10NS</name>
                              <description>Minimum 10ns filter</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SLEWRATE</name>
                        <description>Slew Rate Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWRATESelect</name>
                           <enumeratedValue>
                              <name>SMM</name>
                              <description>Standard mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FM</name>
                              <description>Fast mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FMP</name>
                              <description>Fast mode plus</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-speed mode</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SMBUSEN</name>
                        <description>SMBUS Input Buffer Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>Disable</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>50ns - 100ns hold time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>300ns - 600ns hold time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>400ns - 800ns hold time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MEXTTOEN</name>
                        <description>Master SCL Low Extend Timeout</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOEN</name>
                        <description>Slave SCL Low Extend Timeout</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>Transfer Speed</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>SM</name>
                              <description>Standard-Mode (SM) and Fast-Mode (FM)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FMP</name>
                              <description>Fast-Mode Plus (FM+)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-Speed Mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCLSM</name>
                        <description>SCL Clock Stretch Mode</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INACTOUT</name>
                        <description>Inactive Time-Out</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>INACTOUTSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>Disable</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>55US</name>
                              <description>5-6 SCL cycle time-out</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>105US</name>
                              <description>10-11 SCL cycle time-out</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>205US</name>
                              <description>20-21-6 SCL cycle time-out</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUTEN</name>
                        <description>SCL Low Timeout Enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>QCEN</name>
                        <description>Quick Command Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOCLR</name>
                        <description>FIFO Clear</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>FIFOCLRSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TXFIFO</name>
                              <description>Clear TX FIFO</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RXFIFO</name>
                              <description>Clear RX FIFO</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH</name>
                              <description>Clear both TX and RF FIFOs</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>I2CM Control C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA32B</name>
                        <description>Data 32 Bit</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOEN</name>
                        <description>FIFO Enable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXTRHOLD</name>
                        <description>Receive FIFO Threshold</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>RXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated when DATA is present in the FIFO</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is half-full</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is full</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXTRHOLD</name>
                        <description>Transmit FIFO Threshold</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated as long as the FIFO is not full</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when half FIFO space is free</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EMPTY</name>
                              <description>Interrupt and DMA triggers are generated as long as the FIFO is not full</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>I2CM Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BAUDLOW</name>
                        <description>Baud Rate Value Low</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>HSBAUD</name>
                        <description>High Speed Baud Rate Value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>HSBAUDLOW</name>
                        <description>High Speed Baud Rate Value Low</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>I2CM Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master On Bus Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave On Bus Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXFE</name>
                        <description>Tx FIFO Empty Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXFF</name>
                        <description>Rx FIFO Full Interrupt Disable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>I2CM Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master On Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave On Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXFE</name>
                        <description>Tx FIFO Empty Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXFF</name>
                        <description>Rx FIFO Full Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
