Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00048.svd
               <register>
                  <name>LENGTH</name>
                  <description>USART Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LENENSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Length counter is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TX</name>
                              <description>Length counter is enabled for transmit</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RX</name>
                              <description>Length counter is enabled for receive</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>USART Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSPACE</name>
                  <description>USART FIFO Space</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TXSPACE</name>
                        <description>Tx FIFO Empty Space</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RXSPACE</name>
                        <description>Rx FIFO Filled Space</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOPTR</name>
                  <description>USART FIFO CPU Pointers</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>CPUWRPTR</name>
                        <description>CPU FIFO Write Pointer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPURDPTR</name>
                        <description>CPU FIFO Read Pointer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x4480A000</baseAddress>
         <interrupt>
            <name>SERCOM1_6</name>
            <value>67</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_5</name>
            <value>68</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_0</name>
            <value>69</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_1</name>
            <value>70</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_2</name>
            <value>71</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_3</name>
            <value>72</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_4</name>
            <value>73</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x4480C000</baseAddress>
         <interrupt>
            <name>SERCOM2_6</name>
            <value>74</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_5</name>
            <value>75</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_0</name>
            <value>76</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_1</name>
            <value>77</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_2</name>
            <value>78</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_3</name>
            <value>79</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_4</name>
            <value>80</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x4480E000</baseAddress>
         <interrupt>
            <name>SERCOM3_6</name>
            <value>81</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_5</name>
            <value>82</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_0</name>
            <value>83</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_1</name>
            <value>84</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_2</name>
            <value>85</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_3</name>
            <value>86</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_4</name>
            <value>87</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM4</name>
         <baseAddress>0x44820000</baseAddress>
         <interrupt>
            <name>SERCOM4_6</name>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_5</name>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_0</name>
            <value>106</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_1</name>
            <value>107</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_2</name>
            <value>108</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_3</name>
            <value>109</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_4</name>
            <value>110</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM5</name>
         <baseAddress>0x44822000</baseAddress>
         <interrupt>
            <name>SERCOM5_6</name>
            <value>111</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_5</name>
            <value>112</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_0</name>
            <value>113</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_1</name>
            <value>114</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_2</name>
            <value>115</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_3</name>
            <value>116</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_4</name>
            <value>117</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SUPC</name>
         <version>039261c0</version>
         <description>Supply Controller</description>
         <baseAddress>0x45002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SUPC</name>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVDET</name>
                     <description>Low Voltage Detector Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVDRDY</name>
                     <description>Low Voltage Detector Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDORDY</name>
                     <description>User LDO Regulator Ready Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDOOVHEAT</name>
                     <description>User LDO Regulator OverHeat Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDUSB</name>
                     <description>BORVDDUSB Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDVREGRDY0</name>
                     <description>Additional Regulator ready 0 Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVDET</name>
                     <description>Low Voltage Detector Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVDRDY</name>
                     <description>Low Voltage Detector Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDORDY</name>
                     <description>User LDO Regulator Ready Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDOOVHEAT</name>
                     <description>User LDO Regulator OverHeat Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDUSB</name>
                     <description>BORVDDUSB Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDVREGRDY0</name>
                     <description>Additional Regulator ready 0 Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVDET</name>
                     <description>Low Voltage Detector Interrupt. Set to one if VDDIO crosses the treshold voltage in the good direction according to LVD.DIR.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVDRDY</name>
                     <description>Low Voltage Detector Ready Interrupt. Set to one if LVD is ready to operate.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDORDY</name>
                     <description>User LDO Regulator Ready Interrupt. Set to one if ULDO is ready meaning that output voltage is correct.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDOOVHEAT</name>
                     <description>User LDO Regulator OverHeat Interrupt. Is set to one if overheat condition is detected.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDUSB</name>
                     <description>BORVDDUSB Interrupt. Set to one if VDDUSB issue is detected.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDVREGRDY0</name>
                     <description>Additional Regulator ready 0 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Flag status</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVDET</name>
                     <description>Low Voltage Detector Status.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVDRDY</name>
                     <description>Low Voltage Detector Ready Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDORDY</name>
                     <description>User LDO regulator Status. It corresponds to vreg_ready_mv signal from ULDO.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDOOVHEAT</name>
                     <description>User LDO Regulator OverHeat Status. It corresponds to vreg_overheat_event_mv signal from ULDO.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDUSB</name>
                     <description>BORVDDUSB Status. One if VDDUSB is OK. It corresponds to bor_vddusb_n_mv signal of SMOR.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDVREGRDY0</name>
                     <description>Additional Regulator ready 0 Status. One if voltage is OK. It corresponds to vreg_ready_mv signal of additional regulator.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronisation Busy</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BOR</name>
                     <description>BOR Synchronization Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BOR</name>
               <description>BOR Control</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCBORPSEL</name>
                     <description>Duty Cycle BOR Prescaler Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DCBORPSELSelect</name>
                        <enumeratedValue>
                           <name>NODIV</name>
                           <description>Not Divided</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide clock by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide clock by 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide clock by 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide clock by 16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide clock by 32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide clock by 64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide clock by 128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BORFILT</name>
                     <description>BOR filtering</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BORFILTSelect</name>
                        <enumeratedValue>
                           <name>NOFILT</name>
                           <description>No digital filtering</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT32US</name>
                           <description>32us filtering</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT125US</name>
                           <description>125us filtering</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT250US</name>
                           <description>250us filtering</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
